<template>
    <div>
        <div class="row no-gutters">
            <div class="col-md-4">
                <div class="column-image-wrapper">
                    <img class="d-none d-md-block" src="@/assets/images/Ikaruga-sm.jpg">
                    <img class="d-md-none" src="@/assets/images/Ikaruga.jpg">
                </div>
            </div>
            <div class="col-md-8 p-4">
                <h2 class="section-title text-primary">從叛逆走向變革：《斑鳩》的不破不立。</h2>
                <span class="text-muted">發布於 2020-05-30</span>
                <div class="column-text-wrapper mt-3">
                    <blockquote class="blockquote">
                        人類最偉大的精神，莫過於執著堅持理想永不放棄。而斑鳩的男主角森羅也說過這樣的話：<br>
                        "不留遺憾地繼續走下去直至盡頭。我，沒有出生，就不會死去。理想事物，沒有滿足，就絕不屈服。這樣，即使是死去，也不會後悔。"
                    </blockquote>
                    <p>
                        在前作的基礎上，本作的遊戲機制變化不大，可玩性絲毫不減。算是一種變相的妥協吧，本作有相應的簡化。本作只有黑白兩種攻擊方式，這正應了斑鳩這種鳥有黑白二色。<br>
                    </p>
                    <p>
                        玩家要變化自己集體的顏色發射相應顏色的子彈，敵機也會放出兩色的彈幕，玩家的自機可以同性相吸，吸收相同顏色的子彈積攢能量槽，使出“力之解放”這樣類似於bomb的招數。用異色的子彈對敵機有1.5倍傷害。連續擊破三架顏色相同的敵機才能達成一次連擊。連擊越多，分數越高。在300萬分時自己會有獎命，此後每500萬分，玩家便能得到一次獎命。遊戲流程也只有半個小時。<br>
                    </p>
                    <p>
                        但縮短的流程、簡化的操作意味著更高強度的推版。但即使是在加快的節奏感下，玩家仍需要思考如何最大效率地擊破敵機，所以背板是不可少的，高手推斑鳩也是十分賞心悅目的，國外有大神同時操縱2P通關，不可不謂之為神人。
                    </p>
                    <p>
                        本作的劇情架構簡單明了。每一關的標題都對應了一個主題：理想，試煉，信念，現實，輪迴。<br>
                        理想這關十分簡單，代表了初生牛犢不怕虎的精神；試煉一關難度激增，代表歷經重重磨難；信念這關難度略微降低，代表重新振作;但隨之而來的就是現實的沉重打擊。這一關相當於於boss從頭打到尾，讓人心頭一震；最後在輪迴時主角們拾起理想，決死一搏。
                    </p>
                    <p>
                        但我一直想說的是，故事簡單未必是件壞事。很多時候編劇啊作家啊總想建立一個龐大的架構支持整個故事，這樣的劇情不鳴則已，一鳴驚人。但這樣的水平並不是所有人都能達到的。<br>
                        《尼爾：機械生命》對於我來說就是個玩脫的例子。這讓我想到最近貝塞斯達發售的兩款大作《德軍總部：新巨人》和《惡靈附身2》。德總的劇情一向是經典套路的美國大片風格，但卻主旋律滿滿，能真切地感受到劇情帶來的誠意。<br>
                    </p>
                    <p>《惡靈附身2》的劇本不再由三上真司編寫，因此本作的劇情沒有了前代那般晦澀難懂。雖說撿垃圾順便救女兒的梗從《寂靜嶺1》起就已經被玩壞了，但是在極惡之下卻能展現人性的光明和純粹的善良，這份三上一直堅持的價值是永不過時的。所以能把簡單的劇情講得好，反倒要下一番苦工。</p>
                    <p>
                        《斑鳩》的理念也正基於此。無論是從標題，再到每關開頭出現的話語段落，再到結局的對白，毫無疑問的是，《斑鳩》在用自己的方式講述一部史詩。<br>
                        遊戲將故事濃縮，以這些段落為載體讓玩家思考，再通過彈幕的演出來渲染悲劇的效果，到了結局，玩家自然會明白這一切的付出是否值得。而官方也有關於斑鳩的文字，補充了所有故事的情節。<br>
                    </p>
                    <p>
                        這是一個為了自己意志而獻身的故事，這是一部濃縮了人生的史詩。值得一提的是，閃銀和斑鳩的最終boss都是The-Stone Like，名為產土神輝黃之塊。在閃銀中這個boss在不同階段展現的形態宛若地球、人類的演變和進化。<br>
                    </p>
                    <p>
                        而在斑鳩中，男女主角森羅和篝為了意志與和平和產土神同歸於盡，最終迎來和平。結局的boss戰BGM前奏，也正是第一關理想BGM的前奏。<br>
                        原文： <a href="https://www.gimmgimm.com/article/info/12474.html" target="_blank">https://www.gimmgimm.com/article/info/12474.html</a>
                    </p>

                </div>
            </div>
        </div>
    </div>
</template>

<script>
export default {
  data() {
    return {

    };
  },
};
</script>
